app/controllers/products_controller.rb

  def index
    if params[:category].blank?
      @products = Product.by_status(:show).order_by_created
---
SELECT "categories".* FROM "categories"
SELECT "products".* FROM "products" WHERE "products"."status" = $1 ORDER BY "products"."created_at" DESC  [["status", 1]]

  def load_product
    @product = Product.find_by id: params[:id]
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]