app/views/layouts/_header.html.erb

          <ul class="dropdown-menu" role="menu">
            <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"